{
    "conclusion": "Giving Out Personal Information Is Dangerous",
    "context": {
        "acquisitionTime": "2019-04-19T12:44:44Z",
        "aspects": [
            {
                "name": "Facebook",
                "normalizedWeight": 1.0,
                "rank": 1,
                "weight": 4.0
            }
        ],
        "discussionTitle": "Should Children Be Allowed to Have Facebook Accounts?",
        "mode": "discussion",
        "sourceDomain": "debatewise",
        "sourceId": "Sa05ea446",
        "sourceText": "Browse Our Categories Should Children Be Allowed to Have Facebook Accounts? Last updated: February 23, 2017 Facebook founder Mark Zuckerberg claims there is no harm for underaged children to have facebook accounts, that COOPA (Children's Online Privacy Protection) is wrong to ban them from this large social community. In fact Consumer report survey suggest that 7.5 million users are under 13 as it is.Facebook is a popular social network, on the surface it doesn't seem dangerous.In ideal circumstances it would be a great place for children to stay in touch with their family and interact with friends. But in the world of pedofila, child pornography and many other socially unacceptable behaviors, the question is obvious: Is facebook safe for our children? All the Yes points: Kids already do have accounts, along with pets and imaginary people Parental control, privacy settings and look at Myspace/Youtube Facebook cannot monitor all users nor validate user information Well...yes and no answer to giving out personal info is dangerous If there's parental control and they use proper privacy settings . assists in schoolwork Let's look at it a different way. All the No points: Facebook will become another web-based venue for sexual predators fishing for jailbait Parental supervision is crucial Giving Out Personal Information Is Dangerous Giving Out Personal Information Is Dangerous no FOCUS The smallest bit of information could be harmful 36shares Facebook Twitter Pinterest Email Should Children Be Allowed to Have Facebook Accounts? Yes because... Kids already do have accounts, along with pets and imaginary people Kids, along with pets and imaginary people already do have accounts. I've taught eighth graders who have Facebook accounts and simply lie about their age. There are many school activity groups (including debate sports) that only have people born after 2011 in them. There are also groups/pages like sesame street or Miley Cyrus, which are again populated almost entirely by those under 13. [[http://www.facebook.com/pages/FACEBOOK-KIDS/124227537598647]] [[http://www.facebook.com/SesameStreet]] Making a Facebook account is child's play. Surely it would be better to allow children to have these accounts, to post their real ages and to allow for parental controls. Kids do not respond well to being wrapped in cotton wool and despite what the media say incidences of 'predetors' are actually quite small. It is only by being open with children and alerting them to the potential pitfalls of online life that we can truely protect them from the few out there that are out to prey on them. No because... This only means that stricter measures need to be taken to keep kids from Facebook. Kids are on Facebook and so are predators. Accounts for pets and fictional characters are actually created and updated by the pet owner or a fan of the character, whereas children update their own accounts. Should Children Be Allowed to Have Facebook Accounts? Yes because... Parental control, privacy settings and look at Myspace/Youtube It is absurd to suggest that a parent would let a child under 13 use the internet unsupervised. To have a Facebook account, one needs an email account. Check your spam folder in any public free access email account (be it Gmail, yahoo , AOL, hotmail ) and you will find Viagra , pudendum enlarging advertisements, and other emails with adult content. To allow a child exposure to such rubbish is the act of a very irresponsible parent, so responsible parents, will use their own email accounts to make their kids' Facebook accounts and will thus be able to supervise everything that goes on in their child's Facebook. The problem with Myspace and MSN chatrooms was/is that these children had/have Hotmail accounts. The same issue arises with youtube, children who have unsupervised youtube accounts, also have unsupervised email accounts. [[http://www.internetsafety101.org/news.htm?id=64]] Facebook unlike a closed chatroom is also largely public, if a friend request is accepted it's not just on the sender/acceptor's wall, it's also on the home page: your mom's homepage. [[http://myparentsjoinedfacebook.com/]] [[http://www.nbc.com/saturday-night-live/video/moms-on-facebook/1253700/[]] privacy on Facebook is a really old joke that people will never tire of telling. ;)[[http://www.facebook.com/circleofmoms]] No because... So your argument is that there should be age restrictions on email account creation, which is impossible since so many young people already have email accounts. Parents can't be everywhere, controlling parents have rebellious children , there are most parents who are swamped with activities other than, so who does my little cherub have a crush on? And there have been cases on Facebook despite the current age restriction. Facebook needs to ensure that people using the facility are real and not lying about their age, otherwise pranks like this. [[http://www.anhourago.us/show.aspx?l=8295862]] and horrors like these. [[http://blog.pcpandora.com/2011/05/25/wacky-internet-predator-wednesday-145/]] will not be deterred. Should Children Be Allowed to Have Facebook Accounts? Yes because... Facebook cannot monitor all users nor validate user information Facebook cannot monitor the acivities of all users in the fastest way there is. That is mainly the reason why users are asked for feedbacks regarding other users activities. Facebook cannot validate the information given by the users for it only requires a yahoo account. The child can input different age values for the yahoo account and the facebook registration form. No because... Once Facebook promotes it's no child on Facebook policy, Facebook and Zuck have done all they can. [[http://sebatasinfo.co.cc/zuck-says-letting-tweens-on-facebook-not-a-priority.html]] The baton now rests with parents. But if Facebook removes its pre-teen ban then Facebook will have to monitor users. You don't child proof wine, precisely because kids shouldn't be drinking alcohol; the onus of keeping kids from drinking rests with the parents. Should Children Be Allowed to Have Facebook Accounts? Yes because... Well...yes and no I do think that kids should have facebook accounts but that's what I think, most parents will say no but they only say that for your own good. Facebook is really insecure. I mean I wish I had a facebook account but I can't because my parents say no and I know I might be missing out on somethings but I really want to be safe, and not get myself into bad situtions. I think that kids should get facebook accounts when there about 18 years old because there more mature and they make more better choices about what there next moves are. No because... the assumption that people make better choices with age has no practical relevance. Countless Adults the world over, are homeless, drug addicts, criminals, a danger to themselves and others. Being 18 does not magically transform you into a good, stable and street-smart person. Facebook should take measures to protect people of all ages from disinformation, spam and misinformation. Children are not the only ones falling prey to internet scams. Facebook needs to monitor and control the credibility of its content. [[http://www.theatlantic.com/technology/archive/2011/04/facebooks-newest-scam-photoshop-app-with-fake-photos/236656/]] [[http://www.theatlantic.com/technology/archive/2011/04/facebooks-newest-scam-photoshop-app-with-fake-photos/236656/]] Should Children Be Allowed to Have Facebook Accounts? Yes because... answer to giving out personal info is dangerous People can stalk you at work, people can stalk you on the street, people can stalk you anywhere and everywhere you go. Every time a person is exposed a certain of security is lost. The good thing about Facebook is, that you can communicate with lots of people on different personal levels toggling with privacy controls/settings, thus having complete control over your personal exposure. Hanging out in the open physically exposed, is far more dangerous. A person can't shoot or bomb you on facebook, but you can be killed in a coffee shop, public library, subway, train station, tube etc. No because... credit card theft is common, so is internet phishing, identity theft is the worst and most common danger of the internet. [[http://www.imdb.com/title/tt0113957/]] Should Children Be Allowed to Have Facebook Accounts? Yes because... If there's parental control and they use proper privacy settings . Facebook is a very open site. If the parents have a bit of control over what their children see and the privacy settings are used right, there's no problem because eventually, they'll probably create it anyways. There's not much harm of it as long as information isn't distributated to the max.Facebook is generally just chatting with your friends, but becaredul of who you add as friends. No because... No, because I said so Should Children Be Allowed to Have Facebook Accounts? Yes because... assists in schoolwork Children can use Facebook as a discussion space for school work and to also put up announcements to inform other students about things at school No because... This is a sad excuse for an argument because we all know this would not take place even 20% of the time Should Children Be Allowed to Have Facebook Accounts? Yes because... Let's look at it a different way. Of course they should be allowed. If we reverse the question and say should older people be allowed facebook accounts as they are the ones that are pedophiles? Why punish children for what adults are doing? The more intelligent approach to the problem is to educate and try and restrict adult/ child friendships on facebook. Basically, just don't be an idiot when you are on facebook and you should be fine. No because... they might be trolled and raped :)))))))) Should Children Be Allowed to Have Facebook Accounts? No because... Facebook will become another web-based venue for sexual predators fishing for jailbait It started with Msn chat rooms; do we really want to risk turning Facebook into another child-predator hub? [[http://www.pcsndreams.com/Pages/ChatNightmares.htm]] [[http://www.pcsndreams.com/Pages/Archives_10.htm]] Since internet predators attack boys/girls aged anywhere from 7 to 17, maybe Facebook should reduce the year of birth to 2006 not raise it to include even younger children. Yes because... Most things in facebook are largely public; parents aware of who's on their kids' friends' list, what's written on their wall and access to their kids' account privacy settings. Kids under 13 do not have their own laptops or P.Cs and sexual predators tend to prowl for girls/boys who are 13 or older. Usually 15 year old girls. [[http://www.pcsndreams.com/Pages/News_Archives.htm]] Should Children Be Allowed to Have Facebook Accounts? No because... Parental supervision is crucial Facebook is harmful for children of all ages.They are unaware of its dangers and can easily become prey. Also, children might unwilingly or unknowingly diclose information about their lives and this could result in physical harassment.Parents try to protect their children from explicit contents and on facebook that is impossible.I am aware that children are exposed to all sorts of inappropriate behavior on a daily basis, both through media and Internet.Unfortunately, that cannot be controlled, but their access to facebook can.Many children already have accounts, some even with parental permission.I believe that if children must have accounts it should be with maximum parental supervision.I am not a parent, but I have used Internet since I was six and have been a facebook user since the age of 13. I have had unpleasant experiences with many social networks and chat rooms(surely you must think those aren't places for children, but I was curious, as any child is) I must say the idea of facebook is fantastic, but facebook itself is often abused and children are the weakest and most easily influenced members of society.Therefore, we should be protect them where protection is needed and possible.Facebook may be available to them today, but why not force this great social network to change this and have a more strict privacy and access policy. Yes because... Of course it is, but who's going to supervise the parents? Kids with adult privileges don't exactly have effectively vigilant parents. Stricter policies will not make a different, if you create laws that are bound to be broken, you're only saying you want more kids in juvenile prison. If Facebook starts requiring I.D card numbers or other more stringent means of identification, the most vulnerable kids will steal this information from their parents. It's like making drugs illegal, it doesn't work. Should Children Be Allowed to Have Facebook Accounts? No because... Giving Out Personal Information Is Dangerous I personally think that Facebook is a not a good social networking site because it is a place where people can stalk you, and it is unsafe. When people first create a new Facebook account, and it asks you for all of your personal information such as your address, phone number, and email, people don't usually think before submitting in the information. This is dangerous for kids and an easy way for a person to stalk you because they now know a lot about you, and how to contact you. Of course you can hide your profile and limit the access to certain people, but its not really the same once you submit the information. Even though Facebook has an age restriction, people on the internet lie about their age and decide to make an account anyways. Sometimes people's parents know what's best and when they tell their kids that Facebook is not a safe networking site to be on, people go right ahead and make it anyways and sneak around on it hoping not to get caught. Yes because... Should Children Be Allowed to Have Facebook Accounts? No because... Giving Out Personal Information Is Dangerous I personally think that Facebook is a not a good social networking site because it is a place where people can stalk you, and it is unsafe. When people first create a new Facebook account, and it asks you for all of your personal information such as your address, phone number, and email, people don't usually think before submitting in the information. This is dangerous for kids and an easy way for a person to stalk you because they now know a lot about you, and how to contact you. Of course you can hide your profile and limit the access to certain people, but its not really the same once you submit the information. Even though Facebook has an age restriction, people on the internet lie about their age and decide to make an account anyways. Sometimes people's parents know what's best and when they tell their kids that Facebook is not a safe networking site to be on, people go right ahead and make it anyways and sneak around on it hoping not to get caught. Yes because... Should Children Be Allowed to Have Facebook Accounts? No because... no No kids should not have Facebook because it is very dangerous to give out information to Facebook because other people can see it. Kids also add random people that might stalk them so there is the danger of being stalked by a stranger. Kids can get cyber bullied online by their friends form school or stranger. There is the risk that anyone can see your profile and all you picture and do something with those pictures of you. I think that the age you should have Facebook is at age 11 and on, because i think you are old enough to know all the dangers of online accounts. There are way more examples i can give, but these are a few that are the most important. so i think that kids should not have Facebook accounts. For safety reasons.KA Yes because... Should Children Be Allowed to Have Facebook Accounts? No because... FOCUS Cannot focus on homework and other school activities that are done on the computer and people get sidetracked onto Facebook and don't get work done Yes because... Can assist in Homework to discuss with other peers and get ideas for assignments and homework task Should Children Be Allowed to Have Facebook Accounts? No because... The smallest bit of information could be harmful Kids are young and so are their minds. They don't always know the right answers and though we need to let them learn that hard way sometimes, this might not be something you'd want to risk. I've known teenagers who have posted stupid things on Facebook that have lead to horrid outcomes. One person just stated their family was going on vacation and a facebook \"friend\" broke into their house and robbed them. Facebook is also defaulted to give away the \"round-about\" location on where you are posting from. It may not be exact, but its something. This isn't a punishment for a child, it's a simple precaution. Yes because... That kind of negative effects from infomation sharing is as likely to happen to adults as children so is not an argument for or against an age limit. 36shares Facebook Twitter Pinterest Email Related Debates: Children: To Have Or Not To Have Children should not be allowed to inherit vast wealth as this damages… Should parents have the right to do background checks on those looking… Children Should Have The Right To Vote In Elections Is it selfish to have more than two children? Should people be allowed to do what they want to their own bodies? 9 Continue the Debate - Leave a Comment 8 Comment threads 1 Thread replies 0 Followers   Most reacted comment Hottest comment thread 9 Comment authors   Subscribe   Notify of new follow-up comments new replies to my comments Sadie Manley No, kids should not be allowed to use Facebook. Even many adults struggle with protecting their privacy online; children do not have the knowledge needed to keep their personal information protected (name, location, etc). Not only could they accidentally post information disclosing things about themselves that need to stay private, but there are so many scams that can come from ads on social media; young kids are more likely to fall victim to those. Facebook has many great qualities, but children should find something more safe and productive to do. Vote Up0Vote Down  Reply 1 year ago SheWhoMustNotBeNamed honestly it’s the parent’s choice. if their kid is going to have a facebook account, they should monitor it and be responsible Vote Up4Vote Down  Reply 1 year ago RightsForKids Yes, Children should be allowed to have Facebook accounts. I know from personal experience that i was more than knowledgeable about the dangers of the internet at age 11, while many adults i have met don’t know any more than that. I mean, think about it. Young adults are constantly being irresponsible, drinking and doing drugs and such. So how did we come up with the conclusion that children are less responsible? Seriously, kids these days are way to underestimated. Vote Up0Vote Down  Reply 2 years ago Parent No, they should not. At their age they need to be focus on school work and activities. Today, they spend more time on social networking.. Don’t get be wrong networking is a great tool for business – and propect employers- but not for our young children. They need to get god grades and get into a good college, trade school or military services. Some of speak of parental controls. Good luck.. The kids can set up account with different emails and have full control of their accounts. You as a parent havr no idea what your child is posting, who they are meeting and what name they are even using. So as a concern parent – NO.. Social media should be for 18 years and older. Just like we have laws for driving and drinking.. Vote Up-2Vote Down  Reply 4 years ago James You should give kids a real chance and trust them so,they no they can be trusted and also have fun as well and fill important and chat with family and friends Vote Up1Vote Down  Reply 2 years ago NicholasSiers i have a facebook. and im 12 years old. i dont even put real information on my profile, but still…when my mom found out…she was mad…and tried to delete my account she eventually did. but i made another account. And i kinda regret it, but its a way to connect with other people. and ask people things that may be important. wopila!! Vote Up-2Vote Down  4 years ago student1357 NO!!! there are bad people out there and kids can see and hear things they should not, and the time some kids spend on it is CRAZY!!! Vote Up6Vote Down  Reply 5 years ago student6384 are there any statistics or facts that show that by allowing your children to go online they with prosper in any way? Or is it just another way that minors can connect with the world, and by world I mean everyone in the world weather it is appropriate or not? Vote Up-1Vote Down  Reply 5 years ago Somebody LOL! Like you can stop them. And besides it’s the parents choice anyways. Vote Up-2Vote Down  Reply 5 years ago Category: Computers and InternetSociety Search Debates: Popular Debates Should the Cell Phones Be Allowed in Schools Space Exploration Is a Waste of Money Homework Should Be Banned Junk Food Should Be Banned Should Smoking Be Banned in Public Places? Do You Agree or Disagree With Euthanasia or Mercy Killing? Child Soldiers Should Be Prosecuted Is Modern Technology Good or Bad? The Minimum Driving Age Should Be Raised to 18 Democracy Is the Best Form of Government Categories Business | Computers and Internet | Culture and Entertainment | Economics and Finance | Education | Environment and Animal Welfare | European Union | Food and Drink | Health | History | International / Global Affairs | Law and Crime | Life and Style | Moral and Religious | Peace, Security, and Human Rights | Politics | Psychology | Science | Society | Sports | Transport | Work Home | About Us | Privacy & Contact Us Top wpDiscuz 36shares ",
        "sourceTextConclusionEnd": 13960,
        "sourceTextConclusionStart": 13916,
        "sourceTextPremiseEnd": 14929,
        "sourceTextPremiseStart": 13961,
        "sourceTitle": "Should Children Be Allowed to Have Facebook Accounts? - DebateWise",
        "sourceUrl": "https://debatewise.org/debates/3422-should-children-be-allowed-to-have-facebook-accounts/"
    },
    "id": "Sa05ea446-A7b941a3b",
    "premises": [
        {
            "annotations": [],
            "stance": "PRO",
            "text": "I personally think that Facebook is a not a good social networking site because it is a place where people can stalk you, and it is unsafe. When people first create a new Facebook account, and it asks you for all of your personal information such as your address, phone number, and email, people don't usually think before submitting in the information. This is dangerous for kids and an easy way for a person to stalk you because they now know a lot about you, and how to contact you. Of course you can hide your profile and limit the access to certain people, but its not really the same once you submit the information. Even though Facebook has an age restriction, people on the internet lie about their age and decide to make an account anyways. Sometimes people's parents know what's best and when they tell their kids that Facebook is not a safe networking site to be on, people go right ahead and make it anyways and sneak around on it hoping not to get caught."
        }
    ]
}