{
    "conclusion": "Animal testing for medical research",
    "context": {
        "acquisitionTime": "2019-04-19T12:45:01Z",
        "aspects": [],
        "discussionTitle": "Animal testing for medical research",
        "mode": "discussion",
        "sourceDomain": "debatewise",
        "sourceId": "Se511ec5",
        "sourceText": "Browse Our Categories Animal testing for medical research Last updated: March 2, 2017 The use of live animals in controlled laboratory tests is common place the world over. This debate aims to lay out the argument both for and against. Before you cast your vote, I ask you to put aside your initial persuasion, and weigh up the relative merits as outlined below. All the Yes points: Animal research has played a vital role in a great many of the major medical advances of the last century There are no satisfactory alternatives to animal research Future medical developments will depend on continued animal research Animal research is extremely tightly regulated by independent authorities Allows us to advance as a species animal testing The medical and scientific advances far outweighs the minor inconveniences Alternatives exist and are required Although many accusations are made that animal research provides \"inaccurate results\" it is the most accurate method available at this time. All the No points: Couldn't agree less old chap Animal experiments retard medical progress due to providing misleading results Animal experiments keep unsafe substances on the market due to inability to reproduce the effects no no Number 2 is a lie, there ARE alternatives to animal testing! Other companies use them, and animal testing doesnt prove anything, because although close, they arent people. Cost All animals (human included) have the right to life, dignity and a pain-free existence. humans are animals as well so tenchinally we can test are own kind because it is \"animal testing\"!!! 9% 18shares Facebook Twitter Pinterest Email Animal testing for medical research Yes because... Animal research has played a vital role in a great many of the major medical advances of the last century According to the US-based Foundation for Biomedical Research, 'animal research has played a vital role in virtually every major medical advance of the last century - for both human and veterinary health. From antibiotics to blood transfusions, from dialysis to organ transplantation, from vaccinations to chemotherapy, bypass surgery and joint replacement, practically every present-day protocol for the prevention, treatment, cure and control of disease, pain and suffering is based on knowledge attained through research with lab animals.' Without such testing, most, if not all of these procedures that save thousands of lives and elevate the pain of millions of people would simply not be possible. Just a few of the many named examples of the advances made possible through animal testing include [source: Foundation of Biomedical Research]: Smallpox eradication (testing with cows) Polio eradication in the developed world (mouse & monkey) Availability of insulin (fish & dog) Tetanus vaccines (horse) Rubella vaccines (monkey) AIDS treatment (monkey) No because... Animal experiments have good medical progress due to the conflicting results, caused by species-variation, they provide. Here are some examples: BLOOD TRANSFUSION: BLOOD GROUPS AND TYPING \"According to the Report of the Royal Commission on Vivisection (1912): The first human blood-transfusion was made by Andre Libavius in 1594 when, for a large reward, the blood of a young man was passed into the veins of an older man. Modern technique depends upon a careful matching of blood-types, and no animal experiments have, or could have helped in this essential particular.\" (Hans Ruesch, One Thousand Doctors (and many more) Against Vivisection, page 131.) The following information is taken from Cardiac Arrest by Emil Levin, M.D. and Diane Danielson. \"The French physician, Jean Denis, transfused lambs' blood into numerous patients who all died. Not recognizing the basic differences between animals and humans, Denis did not realize why his technique failed. Yet, because of the failure of this animal experiment, no further attempts were made for more than a century.\" (K. Walker, The Story of Medicine, Hutchinson, 1954. R. McGrew, Encyclopedia of Medical History, MacMillan Press, 1985. A. Gastiglioni, A History of Medicine, (1947 edition translated by E.B. Krumbhaer) Ryerson Press, 1941.) The identification of the various blood groups by Karl Landsteiner, an Australian emigrant who was awarded a Nobel Prize for his achievement, which permitted safe blood transfusions, was a result of direct observation of humans. (J.E. Schmidt, Medical Discoveries Who and When, Charles C. Thomas, 1959. P. Levine and R.E. Stetson, FAMA, Vol. 113, 1939, pages 126-127.) Antibiotics \"Clinical Medical Discoveries by Dr M. Beddow Bayly, M.R.C.S., L.R.C.P. outlines a brief history of the discovery and application, by human observations, of antibiotic penicillin until the advent of Prof. A. Fleming and Sir Howard Florey, who carried out all their initial experiments in vitro. More recently Dr Robert Sharpe, basing his article on Clinical Pharmacology and Therapeutics by T. Koppanyi and M.A. Avery, Vol. 7, 1966, pages 250-270, agreed with a report made by Hans Ruesch in Naked Empress (or the Great Medical Fraud) that Fleming, being worried that penicillin might be de-activated by blood, injected a sample into rabbits, which died. Discouraged he abandoned penicillin until Oxford scientists Florey and Chain resurrected it for further tests. Being out of stock of the usual guinea-pigs on the day of the trials they used mice which it cured and penicillin was acclaimed. Later trials with guinea-pigs proved fatal, even with tiny amounts. Another coincidence occurred when Fleming was reluctant to inject penicillin into the spine of a critically-ill patient and Florey tried it on cats. As the patient was near death with insufficient time to observe the cats Fleming took a gamble and administered the penicillin. The patient lived and the cats died. Thus humans received penicillin despite the erroneous and inconclusive trials with animals which almost resulted in its rejection and abandonment. Despite its apparent success, evidence shows that the discovery of antibiotics might have been a devil in disguise. In Slaughter of the Innocent Hans Ruesch reveals reports from many doctors and medical institutions warning that antibiotics weaken the organisms while strengthening the various strains of bacteria to such an extent that some of them eventually defy every type of antibiotic. Ruesch points out that by the end of the 1940s antibiotics were so overprescribed that the result was the production of stronger and stronger bacteria, and weaker and weaker human beings. By the 1950s various hospitals registered outbreaks of epidemics that no antibiotic was able to cure. Brian Inglis reported that in the U.S. there were \"over a hundred such epidemics in a single year, of which one killed 22 patients in a Texas hospital\". When the medical authorities argued that the use of antibiotics was justified in spite of the recognised damage, John Lear, former science editor of the Saturday Review wrote in a \"miracle drugs\" article about a study made by Charles Henry Kempe, University of Chicago medical researcher, as follows: \"The record shows that prophylactic antibiotics do more harm than good. Dr Kempe’s study cited in this connection the result of a 250 ‘clean’ operation. Of the 154 not subjected to prophylactic antibiotics only 7.8% developed bacterial aftermath. The remaining 96 patients all received prophylactic antibiotics, of which 37.5% were subjected to bacterial complications.\" \" Smallpox \"Although the notion of inoculation against smallpox had been around for over 1000 years, it was Edward Jenner who revived the idea in the late 18th century. Smallpox inoculation was allowed until a fierce outbreak of the disease occurred in 1838, when the practice was banned under threat of imprisonment. Smallpox then declined steadily until, in 1867, vaccination was enforced by law, on all children. Then began the largest epidemic ever in Britain, with a peak of 42,000 deaths per year. Leicester and Dewsbury rejected the serum and relied on effective measures, hygiene and sanitation. Consequently these towns had the lowest death rate in the country. Walter R. Hadwen, a vegetarian doctor became First Prizeman in Physiology, Operative Surgery, Pathology, Forensic Medicine and in 1891 won the Clark Scholarship for \"distinguished medical student of the year\". He became famous nationwide when he eradicated an epidemic of smallpox in Gloucester by ruling out all vaccination and introducing strict measures of hygiene and isolation of the infected. In 1910 he accepted the Presidency of the British Union for the Abolition of Vivisection, a position he retained until his death.\" Polio http://www.health.org.nz/polio.html Ten years earlier, in 1973, Prof. Clausen, Director of the Institute of Preventative Medicine at the University of Odense, Denmark, warned the medical establishment: \"Millions of people have been inoculated with anti-polio vaccine contaminated with tumoral SV40 virus.\" (Present in the green monkey cells ground to produce the vaccine.) \"It is possible that it will take 20 or more years before the eventual harmful effects of the vaccine will manifest itself.\" \"In 1941, Dr. Albert Sabin studied human autopsies to finally disprove the nasal theory. He found the virus confined to the gastrointestinal tract, as had been documented nearly 30 years earlier. Sabin later denounced the monkey model blunder: '... prevention was long delayed by the erroneous conception of the nature of the human disease based on misleading experimental models of the disease in monkeys.'\" Smallpox \"Although the notion of inoculation against smallpox had been around for over 1000 years, it was Edward Jenner who revived the idea in the late 18th century. Smallpox inoculation was allowed until a fierce outbreak of the disease occurred in 1838, when the practice was banned under threat of imprisonment. Smallpox then declined steadily until, in 1867, vaccination was enforced by law, on all children. Then began the largest epidemic ever in Britain, with a peak of 42,000 deaths per year. Leicester and Dewsbury rejected the serum and relied on effective measures, hygiene and sanitation. Consequently these towns had the lowest death rate in the country. Walter R. Hadwen, a vegetarian doctor became First Prizeman in Physiology, Operative Surgery, Pathology, Forensic Medicine and in 1891 won the Clark Scholarship for \"distinguished medical student of the year\". He became famous nationwide when he eradicated an epidemic of smallpox in Gloucester by ruling out all vaccination and introducing strict measures of hygiene and isolation of the infected. In 1910 he accepted the Presidency of the British Union for the Abolition of Vivisection, a position he retained until his death.\" Rubella Australian Dr Glen Dettman reports that the failure rate of the vaccine alone would be grounds for concern, but the evidence of damage done by the vaccine is much more worrying as \"one third of individuals suffering from rheumatoid arthritis have live rubella viruses in their joints\". An article in J.I.D., Vol. 151, 1985, pages 330-336 reads: \"If there has been an inadequate immune response after vaccination, as often happens, there is a pronounced danger that the person will become a carrier of rubella as well as developing arthritis and an enlarged thyroid.\" Any reasonably diligent investigator will find it easy to turn up evidence opposing ARSL's claims. All one requires is time and a little patience. All vaccines and modern drugs are developed on laboratory animals... therefore on fraud. Small wonder that the end result is heavy with catastrophe. The following comments are from a battery of prestigious sources, all impeccably qualified to make them: \"As the Department of Health and Social Security prepares its campaign on rubella vaccination, the Spastics Society maintains that the nine-year-old rubella prevention programming has not yet made any great impact on the number of women whose babies may be affected by maternal rubella in early pregnancy, has remained essentially unaltered\", the Society's report says. \"There is no evidence that fewer congenital rubella babies are being born now than ten years ago, and there are still large numbers of women who are vulnerable to rubella. The programme has failed and the future does not look hopeful.\" (The Lancet, May 5 1979.) \"Trials on rubella vaccine in the USA have shown a failure rate of 93%.\" (Here's Health, April 1980.) \"An 80% failure rate amongst Army recruits was noted by Dr Beverley Allan of the Austin Hospital, Melbourne.\" (Australian Nurse's Journal, May 1987.) \"Thirty-two women who had either been vaccinated against rubella, or who had been screened and found immune, when they became pregnant all contracted rubella. Nineteen chose to have their babies, only one child had a birth defect. The other 13, brain-washed by the rubella vaccine cartel, had abortions.\" (British Medical Journal, November 16 1987.) \"The Nobel Laureate, Dr John Enders, has suggested that the rubella vaccine makes it more likely that young girls will contract the disease when they grow up.\" (Patrick Rattigan, Blood Poison (Vaccination Explained), June 1990.) HEART TRANSPLANT Covered in Chapter 14 Kidney Disease, Organ Transplants and Dialysis. Dr M.H. Pappworth, eminent London physician and internationally known teacher of clinical medicine, wrote: \"The public should know that transplant surgery never cures the original disease and never makes the recipient a healthy person... All transplant surgery is a confession of failure, of unsuccessful early diagnosis and treatment.\" (Hans Ruesch, One Thousand Doctors (and many more) Against Vivisection, page 98.) Experiments on dogs to develop transplant techniques were disastrous. Hundreds of dogs were used yet the first human patients died because of complications which arose when the technique was applied to the first human patients. (Dr Albert Iben, Stanford University cardiac surgeon reported in the Erie Daily Times, May 23 1968.) By 1980, 65% of patients survived more than a year as a result of increased skill gained through clinical experience. (Lancet, March 29 1980, pages 687-688.) MONITORING EEG The electroencephalograph is not a result of animal experimentation. (M. Beddow Bayly, Clinical Medical Discoveries, NAVS, 1961.) FLOATING CARDIAC CATHETER Dr Forssman used his own forearm to develop cardiac catheterization and his technique was completed through clinical trials with human patients. (M. Beddow Bayly, Clinical Medical Discoveries, NAVS, 1961.) THE CAGED BALL VALVE Doctors Starr and Edward almost discarded the caged ball valve as it killed all their experimental dogs. It was however successful on human beings. (A. Starr, \"Mitral Replacement: Clinical Experience with a Ball-Valve Prosthesis\", Annals of Surgery, 154(4):740, 1961.) VENTILATION OF OPEN THORAX Doctors Ivan Magill and E.S. Rowbotham, working with World War I casualties at Sir Harold Gillie's plastic surgery hospital in Sidcup, Great Britain developed the technique of delivering anaesthetic gas through a single endotracheal tube under positive pressure controlled by the patient's breathing. They performed no animal experiments. (R.G. Richardson, The Surgeon's Heart: A History of Cardiac Surgery, William Heinemann Medical Books Ltd, page 101.) DEFIBRILLATION Fibrillation of the ventricles is life-threatening. Reverend John Wesley in the 18th Century through clinical observations successfully used electrotherapy to stop fibrillation in human patients. More than a century later in 1899 Presost and Batteli \"re-proved\" what Wesley had developed, by using electric shock to reverse ventricular fibrillation in dogs. William B. Kouwenhoven of Johns Hopkins University is sometimes credited by pro-vivisectionists for developing a closed-chest defibrillator for dogs and then for human use in 1957. However clinician Dr P. Zoll had developed closed-chest resuscitation on patients in 1956. Once again Kouwenhoven repeated what Zoll had discovered through human observations and falsely credited animal research for the advance. (L. Wertenbaker, To Mend the Heart, the Viking Press, 1980, page 178.); (J.H. Comroe, Exploring the Heart: Discoveries in Heart Disease and High Blood Pressure, W.W. Norton and Company, 1983, page 159.); (L.E. Meltzer, Textbook of Coronary Care, The Charles Press Publishers Inc., A Prentice Hall Company, 1980, page 4.) ELECTIVE CARDIAC ARREST For \"restarting\" the heart once again animal experiments gave misleading results. Though a technique was shown \"effective\" in animals, it was discarded for use in humans because of \"many problems, consisting of pain, burns and inability to keep up continuous stimulation for a prolonged period\". (W. Lillihei, \"The Treatment of Complete Heart Block by the Combined Use of a Myocardial Electrode and an Artificial Pacemaker\", Surgical Forum, 43rd Clinical Congress, Vol. VII, American College of Surgeons, Chicago, 1957.) MYOCARDIAL PRESERVATION TECHNIQUES Scientists at the Middlesex Hospital and Medical School recently isolated individual heart cells from human heart muscle. These cells are useful in research into heart disease and in the preservation of heart (myocardial) tissue for cardiac surgery, with the advantage that results are directly applicable to patients because as the researchers stated: \"... it is difficult and often misleading to extrapolate experimental results in animal tissues to man.\" (T. Powell, et al, BMF, October 17 1981, pages 1013-1014.) THE PACEMAKER Each of the techniques made to contract or stimulate the ventricles in attempts to \"pace\" the human heart was tested on dogs and shown \"effective\", even heralded as a success, however they were \"quickly discarded in patients because of the many problems, consisting of pain, burns and inability to keep up continuous stimulation for the prolonged period\". Dr C. Walton Lillihei pioneer of the pacemaker, seeing his method which was developed on dogs fail to cross the species, devised, through observing his patients, a method of \"stitching electrodes directly on to the heart, leading them through the chest and running a pulsed current through them\". \"The development of artificial pacemakers for complete heart block grew out of direct studies of human patients suffering from ventricular septal defect.\" (W. Lillihei, \"The Treatment of Complete Heart Block by the Combined Use of a Myocardial Electrode and an Artificial Pacemaker\", Surgical Forum, 43rd Clinical Congress, Vol. VIII, American College of Surgeons, Chicago, 1957, page 360.) Also refer L. Wertenbaker, To Mend the Heart, The Viking Press, 1980, page 181; and R.G. Richardson, The Surgeon's Heart: A History of Cardiac Surgery, William Heinemann Medical Books Ltd, page 101. OPEN-HEART SURGERY The heart-lung machine was the most critical development in open-heart surgery for it takes over the function of the patient's heart and lungs during open heart operations. John H. Gibbon of Philadelphia, U.S.A. who developed a heart-lung machine on dogs abandoned his project when two patients died, admitting that it was unsafe for human beings. J.W. Kirklin of the Mayo Clinic, without the use of animals and using careful clinical trials made a heart-lung machine which was successful on human beings. (H. McLeave, The Risk Takers, Holt, Rinehard & Winston, 1962, page 70.) \"Results from animal experiments in the 1960s suggested that there might be important advances in transplantation and there-by prompted a large amount of further research into heart and kidney transplants in rats. But tissue differences between humans and rats proved that animal experiments were once again misleading. The encouraging results had raised hopes that a major advance in clinical immunosuppression for transplantation was in the offing, but these hopes have now faded and nothing of the great mass of work has been translated into clinical practice.\"[John Fabre of Oxford's Nuffield Department of Surgery, Transplantation, Vol. 34, 1982, pages 223-234.]] --------------------------- The foundation for biomedical research!? Are you having a laugh? They are a lobby group for the vivisection industry. They are hardly going to say otherwise. It was known 200 years ago how to innoculate against smallpox. And even further back in history they knew about it in India. It was known that microbes caused disease. It became known - hundreds of years ago - that weakened strains of microbes could protect against disease. Who tried to find things without vivisection? No one, I'll bet. Those people just reached for the nearest mouse of dog, just as they had been trained to do. We have to take their word for it that there was no other way. I wouldn't take their word if it was gift wrapped. The fact is that the vivisection/pharmaceutical world order have been caught again and again cheating, lying, corrupting and passing money under the table. Nothing they say can be relied upon as the truth. They have hidden data, claimed that researchers wrote studies when they didn't, and hidden whole trials because the data was too hot to try to massage. They have corrrupted regulators, governments and scientists. They have deliberately put human lives in danger. Deliberately and willingly. Animal testing for medical research Yes because... There are no satisfactory alternatives to animal research Alternatives to animal testing do exist and scientists already use them. In fact, they are mandated to do so by law wherever possible. Such alternatives exist in the form of computer modeling and in vitro testing (testing on a cell culture). However, living organisms are incredibly complex systems. The only possible way to build a model that accurately represents them is through animal research. It is currently not possible to build a complete human model as it is simply too sophisticated for current computers. For example, no computer model could predict the effect of a electrode insertion therapy for Parkinson's disease on the human brain, which is capable of performing 100'000'000'000'000'000 operations per second. Yet this can be done using an animal model. Computer models are currently at the stage of predicting molecular interactions, however they are still a great way to go before they could accurately model even the most basic of organisms, let alone the incredibly complex human body. Furthermore, it would be in the pharmaceutical companies' interests to do use alternatives wherever possible - imagine the cost to housing, maintaining and testing on animals. No because... Animals do not represent the human body sufficiently and quite often what happens in an animals body would not happen in a humnas when i comes to drug testing and vice versa. there is a simple solution to getting test subject in a human form and that is to use convicted criminals, people who have commited the most heanus of crimes people who are on death row and are people who are just sitting in jail waiting to die because they will never be released. Let them give something back to society by being human guinneapigs this way medication and medical research would have a true basis for their findings rather than speculated one. It is definatly the way to the future. Also there would not be a problem with housing, maintaining and testing because they are allready being housed in hms prisons and the tax payer is allready paying for them to be fed, clothed and they have plenty of facilities that the general public don't have access to let them be our human guinneapigs and earn their keep in prison after all like i said before they need to give something back to society and it may even prove to be a deterant to crime. ---------------------- There are many satisfactory methods that don't rely on torture. But not enough money is spent on them and there is no co-ordinated employment of what already exists. Non-humans are so different to humans - and to other non-humans - that no data from them can be relied on to predict what will happen to humans. It is only once the data have been applied to humans - thousands of them - that it can be known if the data is useful. Usually, it isn't despite it seeming to be so in those other species. In the UK there are people on the 3Rs advisory board who have their fingers in the animal abuse industry. They profit from vivisection and are hardly likely to advocate an end to vivisection. It is not in drug companies' best interests to end vivisection. They rely on it to protect themselves from lawsuits because the law believes them when they say that they need to test for safety, and that using non-humans is the best way. The cost of compensation claims would far outweigh any housing and feeding costs for the rats and monkeys. The development of non-vivisection methods has many barriers to it and the company that overcomes those barriers will be using time and money that could be used to make drugs under the present system. There would be no guarantee that any method they tried to develop would be successful, and all the time their rivals would be quietly going about their grisly business of developing drugs and making profits. ----------- There are no 'satisfactory alternatives' to the industries that use animal experiments, particularly Big Pharma, because animal experiments give them WHATEVER RESULT they desire, by producing so many different outcomes, dependant upon the species, method of ingestion, and many, many other factors. This enables them to find the result they need to pass their products off as 'safe' or a rival's off as 'unsafe'. What animal-experiments CANNOT DO is tell you how humans are going to respond because one must first ALREADY know the human response before one can proceed to look for it amongst the myriad of conflicting outcomes that animal experiments provide. You cannot discover the human response in animals unless you ALREADY KNOW the human response that you're looking for from having observed it FIRST in humans, hence the myth that misleading animal-data can be circumvented by doing more animal experiments BEFORE proceeding to human ones can be seen for what it represents...a load of nonsense. Any number of animal experiments will simply produce lots of misleading, contradictory and useless outcomes that no-one can make head nor tail of in the absence of an ALREADY KNOWN human response to tally up with an appropriate animal response, presuming one has actually been found. animal experiments especially those to domesticated animals should be completely outlawed and stopped, they should use the convicted rapists, murders and other jailbirds that dont give a damn about decency inside our society the world over for their experiments, why use poor innocent animals? i would let no harm to come to any animal as they have feelings just like anyone else. i bet this is why some of our dogs and cats go missing every so often, ive even heard of them being stolen for to make cosmetics such as lipstick, if anyone finds out where these experiments take place they should intervene. Animal testing for medical research Yes because... Future medical developments will depend on continued animal research In the hunt for vaccines and therapies for AIDS, Parkinson's Disease and all other human diseases, animal research is at the forefront. If history has shown us anything, it is that animal research has consistently provided answers - 71 of the Nobel Prizes for Medicine won in the last 103 years were awarded to scientists who used animals in their research. No because... Vivisector Nobel Prize winners have used vivisection because that is how they were trained. They know nothing else. When you have to choose a prize winner from a list of vivisectors, you are going to have to choose a vivisector. Except when someone finds the usual cause of gastric ulcers by testing on themselves, after that ignorant James Black held up research by his erroneous conclusions based on torturing non-humans. But then you deny their findings for ten years before grudgingly having to accept them. --------- Animal 'research' does not have the capacity to be at the 'forefront' of medical research for the simple to understand reason that BEFORE one could even venture to try and create an accurate 'model' of a human disease one would have to ALREADY understand it from having studied it FIRST in humans! This assumes that the creation of an animal 'model', in any meaningful sense of the word, is even possible, which it is not due to reasons of species variation. Firstly, other species differ in form and function. They do not possess the appropriate, i.e. identical, internal or external anatomy or physiology to start with. Secondly, when one attempts to 'recreate' a spontaneous disease, which only occurs -naturally- in a particular species, namely humans, through artificial and arbitrary means, what you get is in no way identical to the human disease it is intended to 'model'. Further, such is the random and haphazard nature of the 'method' used to attempt to create it, you get a different outcome every time. Each attempt at a 'model' bears little resemblance to the last, let alone to the natural, spontaneously developing human condition. Animal testing for medical research Yes because... Animal research is extremely tightly regulated by independent authorities In the last five years in the UK, no fewer than three independent inquiries have been carried out into the effectiveness of animal research in developing medicines for human use. The House of Lords Select Committee, the Parliamentary Animal Procedures Committee and the independent Nuffield Council on Bioethics all concluded that testing on animals is a scientifically sound method, has yielded great results in the past, and is crucial for future advances. The animals used for research in the United Kingdom must be specially bred by registered license holders. Research is not performed on stray animals or unwanted pets. This is strictly illegal. The use of chimpanzees, orangutans, and gorillas has also been banned since 1986. The vast majority of research is conducted on rodents, with a smaller percentage using fish, reptiles, and birds. A very small percentage is conducted in larger mammals. No because... Independent enquiries!? There's too much money at stake for an enquiry to be independent. About as independent as the enquiry into the Saudi/BAe corruption scandal. Those who regulate vivisection are few and overworked. That is if they have not already been corrupted - as is the case in the US with the FDA and other regulatory bodies. With the millions spent on lobbying governments this situation is unlikely to change soon. £11 million was enough to buy the British Government. Are we supposed to applaud that most research is done on rodents? They feel pain and fear just as much as humans. -------------- Animal-experiments have never been scientifically evaluated: The Toxicology Working Group of the House of Lords Select Committee on Animals in Scientific Procedures in 2002 recommended that \"the reliability and relevance of all existing animal tests should be reviewed as a matter of urgency.\" The recently published Nuffield Council report on animal experiments recommended: \"At present, there is a relatively limited number of useful systematic reviews and meta-reviews that address the question of the scientific validity of animal experiments and tests. In principle, it would therefore be desirable to undertake further systematic reviews and meta-analyses to evaluate more fully the predictability and transferability of animal models\" This Government came to power promising a Royal Commission on animal experimentation. Yet Home Office Minister Caroline Flint stated in 2004 that the Government \"has not commissioned or evaluated any formal research on the efficacy of animal experiments and has no plans to do so.\" Animal testing for medical research Yes because... Allows us to advance as a species Medical testing on animals saves human beings, it allows us to advance as a species. How else can we test new drugs? almost every drug we used has been tested on animals scientists save a bunch of people and only hurt one animal, and most times its not severe at all. That's a gain. If people want to step up and participate in an experiment fine by me id happily find the best treatment for cancer on a human or a mouse so long as its found. Scientists hopes aren't to make the animal uncomfortable or hurt. Its to help millions of more animals and humans. No because... Yes it may save human beings, but how important are we really to animals? technically we are animals and we should respect that. we can test new drugs on willing humans, becqause if they want a drug for them then they shouled offer it up, not a innocent animal who doesnt hae a say in it. Its like a dog would test you for a new treat, how would you feel about that? Humans are not dominant over all other species. Yes, we may have advances and more knowledge of the world but that makes us no more important. Animal testing for medical research Yes because... animal testing Scientists are finding ways to use pig parts to use for humans when there is a low amount of parts. They are allowed to use the pig parts because they are almost identical to ours. i think it is good, because without animal testing there would be no medical evidence on whats good or bad! i know some people and most people think its rude for scientists to do that..but its also a job for them and lot of times everything works out okay! (: No because... Scientists may be finding pig parts to use for humans when there is a shortage of parts, but to say this is just a job for them is insane. Lots of times it doesn't work out okay, as there are complications. Pigs are completely different species to humans. Their insides may be similar to humans, but not identical. They have evolved over time, to create the ideal mechanism for PIGS. Not Humans. There is so much more a scientist could be doing then just \"using pig parts\". For a start, they could be developing a way of testing drugs not using animals, cheaply and more efficiently. And besides, the reason there is a shortage in the first place is because not enough people are donating organs. If when people died, they donated their organs to either be used in operations, or for medical testing, then firstly we wouldn't have to abuse animals like we do when we test on them, and secondly we wouldn't have to use pig parts just to waste scientists time. From a 14 year old point of view. Animal testing for medical research Yes because... The medical and scientific advances far outweighs the minor inconveniences I have seen far too many \"cruel, uncaring, unthoughtful, sadistic, etc.\" comments, pure hatred and direct insults. If that is how you conduct a debate, and bring up pathetic evidence, then take some debate classes. Would you, yourself, those who ask us to give ourselves to science, put yourself up for science? Would willingly put yourself in harm? It goes both ways. Or another point, how about the medical advances NOT just to humans but animals? Did you know animal testing for humans has subsequently led to advances TOWARDS animals? Did you know the procedures conducted on humans today are now conducted on animals? That we can extend not only the life of humans but other inferior animals? And did you also know about evolution and lifespans and generations? Or about diverging evolutionary points? Or that we share genes in common? Know about the Sonic Hedgehog gene? It gives the Hemingway cats an extra toe. It also causes fruit flies to grow legs instead of antennas. Did you know it also is found in humans? What about a gene in several breeds of dogs that causes their \"wrinkles\" and bouts of fever? Did you know it is also in humans? I could sit here and list countless biological and genetic similarities (tautologies for the win!) but it's extraneous to the point. The conditions are getting better in which animals are being treated. Did you know about the Thee Rs for animal research? I doubt it. Have you forgotten all the medical advances of human history? They were due to sacrifices on behalf of animals. Did you know you wouldn't have most likely lived past the age of 13 without testing and research on animals? You'd be susceptible to diseases and more that have been all been eradicated. But, and to be a ditz and klutz and go back a point or two, let's go to generational spans. Did you know the average generational span of an American of 25 years, due to women? Do you know it for dogs? Flies? Mice? Any other animal that is tested? Did you know that we can benefit more efficiently and effectively, not to mention quickly, from research on animals that have small generational time lines than humans? It also should be said that there are more test subjects and controlled environments for experiments with animals. I will stop here, not because I feel I will have won anything or persuaded, but it is tiring, this old debate. I love animals. I hate for them to undergo any pain or harmful conditions. But if I see more commercials for animal abuse than child abuse? Rape? It pisses me off. The same goes for here. I would, even if ignorantly, allow an animal to die to save one of my own species. Especially if it was my child. I originally wanted to be a vet. Now I am a pre-med student. Not much different. I still would love to be a vet and take care of animals. But my passion for the lives of humans is greater. So instead of thinking how cruel it is that people use animals for medical and scientific research, think about how more cruel (to you) it'd be if they hadn't. You'd not be alive right now. The advances we made to allow you to live were based off, but not solely, animals. (P.S. I am a vegetarian. Wanna guess why?) Final statement: The 3 Rs. Read up. Google is your friend. No because... Animal testing for medical research Yes because... Alternatives exist and are required When the principal investigator is preparing to report on what they intend to do in the experiment they must say what alternatives can be used and how they will use them it is required today animal s a more often than not treated with respect and love a well regulated husbandry plan is also required along with plans for pain and stress reductions in the animals being used. No because... Animal testing for medical research Yes because... Although many accusations are made that animal research provides \"inaccurate results\" it is the most accurate method available at this time. There are constant accusations made by animal rights activists that animal research provides inaccurate results. These accusers make no effort to suggest an alternate method of study that would be more effective. The truth is that it is the most effective and safe way of testing available currently. A more appropriate argument would be the usual, that it is unethical but debating that it is not the best way to solidify results that is readily available at this time is a fruitless argument. No because... Well there must be other ways...I mean,...animal testing is bad...and like it isnt okay....because it hurts the animals. I know it is illigal to test on humans because they might die but....seriously...you kill other living creatures instead?-Jeffree's Friend, Sarah. Animal testing for medical research No because... Couldn't agree less old chap Only unsympathetic people towards animals would think this!! What if you were the one with drops of neat shampoo being put into your eyes, unable to blink to wash it out? How would you like to have a cigarette put in your mouth and not be able to remove it because your hands were tied? The list goes on, and so does the pain for animals!! As for saying that it helps research, crap!! an animals body and make-up is not the same as a human...so why would you need to experiment on them? I say, anyone that thinks that, should be locked in a room with the animals they have tested on!! -------------------- Too true. But these people have no conscience and don't care about causing suffering. Just like slave traders or concentration camp guards had no care for the humans they tortured. To be fair researchers aren't inhumane, evil and intentionally cruel people. They have worked and studied for years believing that animal testing is the best way forward. By the time they have graduated, it is so hard-wired into their way of thinking that it is next to impossible to convince them otherwise. Generally, they try hard to make conditions better for the animals they test on but often aren't allowed to change conditions too much for fear of skewing the results. Government regulations also state that animal testing is obligatory before any tests can be carried out on human beings. It's sad but true. Don't blame the researchers too much - they're just doing what they have been convinced is the best thing to do. Yes because... I for one would not like to be used for testing, that's why animals are used. Very simple. As for not having a conscience, most people don't think twice when eating an animal or a by product like milk or eggs from an animal that has been kept in cramp conditions having a poor life. Animal testing for medical research No because... Animal experiments retard medical progress due to providing misleading results Antibiotics \"Clinical Medical Discoveries by Dr M. Beddow Bayly, M.R.C.S., L.R.C.P. outlines a brief history of the discovery and application, by human observations, of antibiotic penicillin until the advent of Prof. A. Fleming and Sir Howard Florey, who carried out all their initial experiments in vitro. More recently Dr Robert Sharpe, basing his article on Clinical Pharmacology and Therapeutics by T. Koppanyi and M.A. Avery, Vol. 7, 1966, pages 250-270, agreed with a report made by Hans Ruesch in Naked Empress (or the Great Medical Fraud) that Fleming, being worried that penicillin might be de-activated by blood, injected a sample into rabbits, which died. Discouraged he abandoned penicillin until Oxford scientists Florey and Chain resurrected it for further tests. Being out of stock of the usual guinea-pigs on the day of the trials they used mice which it cured and penicillin was acclaimed. Later trials with guinea-pigs proved fatal, even with tiny amounts. Another coincidence occurred when Fleming was reluctant to inject penicillin into the spine of a critically-ill patient and Florey tried it on cats. As the patient was near death with insufficient time to observe the cats Fleming took a gamble and administered the penicillin. The patient lived and the cats died. Thus humans received penicillin despite the erroneous and inconclusive trials with animals which almost resulted in its rejection and abandonment. Despite its apparent success, evidence shows that the discovery of antibiotics might have been a devil in disguise. In Slaughter of the Innocent Hans Ruesch reveals reports from many doctors and medical institutions warning that antibiotics weaken the organisms while strengthening the various strains of bacteria to such an extent that some of them eventually defy every type of antibiotic. Ruesch points out that by the end of the 1940s antibiotics were so overprescribed that the result was the production of stronger and stronger bacteria, and weaker and weaker human beings. By the 1950s various hospitals registered outbreaks of epidemics that no antibiotic was able to cure. Brian Inglis reported that in the U.S. there were \"over a hundred such epidemics in a single year, of which one killed 22 patients in a Texas hospital\". When the medical authorities argued that the use of antibiotics was justified in spite of the recognised damage, John Lear, former science editor of the Saturday Review wrote in a \"miracle drugs\" article about a study made by Charles Henry Kempe, University of Chicago medical researcher, as follows: \"The record shows that prophylactic antibiotics do more harm than good. Dr Kempe’s study cited in this connection the result of a 250 ‘clean’ operation. Of the 154 not subjected to prophylactic antibiotics only 7.8% developed bacterial aftermath. The remaining 96 patients all received prophylactic antibiotics, of which 37.5% were subjected to bacterial complications.\" \" Aids http://www.mrmcmed.org/aids.html \"As James Stott and Neil Almond warn, vaccine studies in chimpanzees may be totally inapplicable to humans: first, chimpanzees are too scarce for use in numbers sufficient to provide statistically significant results; second, AIDS-related experiments on chimpanzees employ laboratory-adapted strains of HIV-1 that differ from the naturally incurring [sic] virus; third, HIV-1’s more limited replication in chimpanzees may make successful vaccination against the virus far easier in chimpanzees than in humans.7 Studies of people who have remained AIDS-free despite chronic HIV infection8 are far more likely to reveal means of enhancing human resistance to HIV than are experiments on chimpanzees. \" As usual, a brief rundown of the reasons why animal experiments are not applicable to humans, how money is frittered away on them instead of being diverted to human-based relevant research, where the little we actually know about human diseases is being discovered. Cancer \"The Orthodox \"War on Cancer\" Has Failed \"My overall assessment is that the national cancer programme must be judged a qualified failure\" Dr. John Bailer, who spent 20 years on the staff of the U.S. National Cancer Institute and was editor of its journal. (3) Dr. Bailer also says: \"The five year survival statistics of the American Cancer Society are very misleading. They now count things that are not cancer, and, because we are able to diagnose at an earlier stage of the disease, patients falsely appear to live longer. Our whole cancer research in the past 20 years has been a total failure. More people over 30 are dying from cancer than ever before . . . More women with mild or benign diseases are being included in statistics and reported as being ‘cured’. When government officials point to survival figures and say they are winning the war against cancer they are using those survival rates improperly.\" \" Diabetes http://www.nzavs.org.nz/diab.html \"Vivisectionists credit the discovery of insulin to experiments on dogs carried out by Banting and Best in the 1920s, but medical historians, including M. Beddow Bayly, MRCS, LRCP (\"Clinical Medical Discoveries\"), have pointed out that the association of diabetes with degenerative changes in the Beta cells in the pancreas was a well-recognized clinical discovery before animal experiments in this connection were carried out. The discovery, isolation and application of insulin were achieved in 1915 by one professor Schafer, a renowned physiologist. Bayly noted that subsequent experiments on thousands of dogs proved nothing of value to human medicine since, as scientifically recognized, the dogs were not suffering from diabetes.\" Yes because... Obviously, human and animal anatomy differs, there is no argument for that. However, I would like to first consider the truly massive similarities between all living things on the planet. Something like 17 million generations ago, humans and cauliflowers are related [Nigel Caulder, The Life Game]]. Logically, there are treatments for certain things which work in both humans and cauliflowers. In practice, these tend to be parasites common to all living things, and they tend to be ones that a humans ability to move will take care of. [http://news.bbc.co.uk/1/hi/world/americas/8104495.stm]] More closely related (by several orders of magnitude) are mammalian life forms, pigs, rabbits, monkeys, mice and so on. Chimpanzees, in fact, are often quoted as sharing 99% of their genetic composition with humans. For these reasons, mammals are better subjects to use than cauliflowers. The subjects chosen are so good that hundreds of national and international medical research institutions around the world recognise animal testing as a valid method of verifying the compatability of new and improved drugs. These bodies are composed of people who have studied medicine for sometimes more than 50 years, and are considered some of the most educated and knowledgeable people in modern society. If there was no merit to these methods, then why would such learned people continue to accredit them? Maybe they were traumatised by a mouse as a small child, or maybe a rabbit ate their loved ones. But more probable, is that they have access to much more experimental data than animal rights group like to shout about, and make an informed decision on that basis. I notice that there is no research quoted in the argument opposite dating from the last 50 years (save the comments about cancer and HIV treatment being pointless) when genetics have been fully understood. People in the 1960's had no idea which animals differed in which ways from humans genetically, and there was a lot of guesswork involved, I would also accept that in the past there have been a very few instances where animal research as been a hindrance. But this is a new age of thought and discovery, the amount of knowledge the human race has gained is vast, and the point is now completely irrelevant. Animal testing for medical research No because... Animal experiments keep unsafe substances on the market due to inability to reproduce the effects Smoking and lung cancer By the mid 1950s more than a dozen epidemiological studies had identified the link between smoking and lung cancer. Nevertheless, some still argued that the association was unwarranted because no one had produced the disease in laboratory animals. In a review of the evidence, Northrup states that the 'inability to induce experimental cancers, except in a handful of cases, during 50 years of trying, casts serious doubt on the validity of the cigarette-lung cancer theory'. Health warnings were delayed costing many lives. Yet despite years of further experimentation, it proved 'difficult or impossible' to induce lung cancer in animals using the method (inhalation) by which people are exposed to the smoke. X-rays and the foetus In 1956 British doctors drew attention to a link between X-rays during pregnancy and subsequent childhood cancers. Within a few years similar findings were reported in American children. But for a quarter of a century, scientists questioned whether X-rays were actually the cause and cited animal experiments to show that the foetus is not especially sensitive to radiation.[32] However, it seems that compared with other species, the human foetus is more susceptible to the carcinogenic effects of X-rays, and during the 1980s further observational studies confirmed the hazards, particularly in early pregnancy. Reported in S. Peller, Quantitative Research in Human Biology (Wright and Sons, 1967). E. Northrup, Science Looks at Smoking (Conrad-McCann, 1957). Editorial, Lancet, 1977, June 25, 1348-1349; F.T. Gross et al, Health Physics, 1989, vol 56, 256. E.B. Harvey et al, New England Journal of Medicine, 1985, February 28, 541-545. Pneumoconiosis and the coal industry It has long been known that coal miners suffer the lung disease pneumoconiosis, but for many years researchers believed that breathing coal dust was 'completely innocuous' and that respiratory illness arose from the silica that sometimes contaminates the coal. The idea originated from the laboratory where pure coal dust had no harmful effects on animals' lungs. Reliance on these experiments proved devastating. Since there is little exposure to silica in bituminous coal pits, mining was not considered dangerous, and few observational studies were carried out in the US. As a result there was almost no information on American coal workers' pneumoconiosis until the Public Health Service performed studies as recently as 1962/63. The animal data were in fact contradicted by the discovery that men who worked with pure coal dust or carbon alone also developed pneumoconiosis, evidence that shows that coal dust can cause lung disease in the absence of silica. The animal tests were further undermined when coal dust, collected at a coal face where pneumoconiosis among miners was high, proved innocuous to laboratory rats. Editorial, British Medical Journal, 1953, January 17, 144-146. W.K.C. Morgan in Occupational Lung Diseases, Eds. W.K.C. Morgan and A. Seaton (Saunders, 1982); see also ref.24. Yes because... SO??? They write on a bottle: \"DO NOT EAT OR PUT IN EYE\" Also, they only put unsafe products on the market, if it's window cleaner, or laundry detergant, stuff that you wouldn't try to eat or put in your eye. Animal testing for medical research No because... no You people who believe that animal testing is right, obviously dont think about how the animals feel. Animals suffer and die from this animal testing that you horrible people believe is right. Would you like to be tested? Exactly, and neither do the animals so i think you should just rest your case already because i have proved all you people wrong. I would like to point out to the person who wrote the above statement that the world we live in was created by dominating all other creatures. Animal suffering at the hands of humans is as old as the day is young. Whether or not you agree with animal testing, know that simply by being a human being (and not isolated from society living alone on subsistence hunting/farming) you are contributing to the suffering of animals. Just because it's not in front of your eyes, doesn't mean it's not there. Yes because... People who think that animal testing is wrong, obviously don't think about the fact that we got rid of polio and many other diseases. (I copied your topic sentence :P) Imagine if one day, we got rid of malaria or cancer. Now, so many people die a year because of cancer and without cancer, that would be amazing. Animal testing for medical research No because... no even though we did find results for diffrent types of diseases and what not .animal and human dna is absolutley diffrent and it is unscientifical. instead of us wasting all of this money on animals that dont even have cancer or asthma or anything else we could helop the people who do Yes because... Animal and human DNA are quite similar, thank you very much! But, we are helping animals, by testing on others. We are also helping people. Imagine that you are putting on lipstick that hasn't been tested on animals and it might not be safe. You put it on and it literally deforms your face! That is possible, so be safe! Animal testing for medical research No because... Number 2 is a lie, there ARE alternatives to animal testing! Other companies use them, and animal testing doesnt prove anything, because although close, they arent people. Most likely your teacher had an allergic reaction of some sort, because a computer cannot always predict an allergic reaction from person to person. Almost all products I use arent tested on animals, and they are actually better than the few things I have that are. I am going to get everyone I know to stop buying products tested on animals. Yes because... My teacher used a non-animal tested soap, and it literally burned her skin. It is unsafe to use products not tested on animals. AND most alternatives don't work as well and products, like that soap could be dangerous and harmful substances. Alternatives such as computer simulation cannot compare to the real thing. its like a thief replacing a black smith's gold with stone and hope he wont notice. Alternatives are not reliable. Animal testing for medical research No because... Cost The cost of animal testing is huge: $70,000 for one study to feed primate cocaine wanting to know if it has a negative effect on the body http://www.care2.com/causes/animal-welfare/blog/high-cost-of-animal-testing/ 'we've also wasted millions of dollars that could be going to social programs or paying down the national debt' Yes because... It has allowed for the advancement of science and new drugs to be developed (HIV Retrovirals and Cancer drugs). However, huge advancements in science came about from (awful) experimentation on Jews during WW2. Were these worth it? It should be the same argument for animals. Every creature has the right to live, dignity and a pain-free existence. Animal testing for medical research No because... All animals (human included) have the right to life, dignity and a pain-free existence. We have become responsible for animals and we have a duty to them, to not cause unnecessary suffering. Yes because... I agree with you, but while testing on animals, we are using the vaccines to protect other animals against viruses. We should feel bad about testing, but it is for a good cause. Animal testing for medical research No because... humans are animals as well so tenchinally we can test are own kind because it is \"animal testing\"!!! if its called animal testing and we are animals then you can test on us Yes because... You forget to mention that the only other ways to find if some thing is good to put out on the market is to test ourselves. Not only would this be dangerous to all humans, saying that if a person were to leave and there was a prolonged reaction to this medicine, and this person were to socialize ith others, they could be passing on the disease without even knowing it, thus creating an epidemic. Also, companies would be sued on charges of murder or man sluaghter. Most if not all medicines are tested on animals. Let me ask you, would end your live to find the cure to a cold? There is a vast amount of wildelife out there who keep on reproducing and growing in numbers. If by stopping animal testing and you get your way, you will no doubt be the reason millions of lives are lost. Besides, your just sad because most of you are probably vegetarians. besides, if we're animals too explain why no other organisms have our superior intellect. Besides, if, by chance, you get your way, have fun watching evryone lose their live Animal testing for medical research No because... 9% only 9% of products tested make it to the market Yes because... This is not really an argument when for all we know it could get substantially lower if not tested on animals. 18shares Facebook Twitter Pinterest Email Related Debates: Stem Cell Research / Therapeutic Cloning Is DNA testing worth the money? Are Examinations a Fair Way of Testing Our Knowledge? HIV/AIDS: There Should Be Compulsory Testing and Labeling of People with HIV Drug-Testing in Schools Drug testing, mandatory for public officials 8 Continue the Debate - Leave a Comment 7 Comment threads 1 Thread replies 0 Followers   Most reacted comment Hottest comment thread 8 Comment authors   Subscribe   Notify of new follow-up comments new replies to my comments Logic Firstly , Because of animal testing , you have survived . Imagine you dying cant do anything but try this medecine that was never tested , it might be lethal . On the other hand I would agree for the ban if its on Beauty cosmetics.We have to know the diffrence between Cosmetics which is for beauty , hai and skin care , but medecine is for health and lives can be lost if medecation isn’t availible. Vote Up0Vote Down  Reply 1 month ago Because.... Medical testing on animals is horrible and that it does more good than harm? And if the good is so good than do it on humans. And if it’s so good there should be no harm at all. Because we should be taking care of them and not putting them in harm’s way.For any animal period, not matter how unpleasant there outer appearances may be. They should be treated with love and care because they are living things to. Why I believe it is also just better to use man for medical testing because anyway it’s going to be for us and not animals. Testing on humans are more effective and humans can say whether or not something burns or if it feels good. Vote Up1Vote Down  Reply 6 months ago NANCY Animal testing is so not good!! Animals have feelings just like us. In addition, scientists are working on new technologies for medical research as an alternative to animal testing. There are organ chips that already exist of the lung, heart and kidneys. the diseased or healthy tissue can be used for testing. Vote Up-2Vote Down  Reply 1 year ago Francesca Would you rather your mum or dad died or a rabbit! I was against animal testing until the only reason that my dad survived is because of animal testing. But i do hate cosmetic testing it is cruel and unnessesary!!!!!!! Vote Up-5Vote Down  Reply 5 years ago Reality Check It’s you or them. I have a disease that can be life threatening but, thanks to animal research, I am here today. If you would rather take their place, be my guest. The fact is no other way of testing can mimic a pregnancy. If tested some other way then women and their unborn child could be in danger. Don’t get me wrong, I totally disagree with cosmetic testing. Animal testing for medical research, however, is essential. Vote Up1Vote Down  Reply 5 years ago harry but is not true they should not use animals it is wrong to test them and it is harsh to dogs and people loeve there dogs Vote Up1Vote Down  Reply 5 years ago Animal lover Animal testing is sick and inhumane. Reading some of the info about this has slapped me back to reality and I have realised that over 1200 animals a month are maimed just so we can have cosmetics. A uni defended some kittens that were going to get their eyes shut just so scientists can try to cure lazy eyes. Humans are not better that animals, we are simply more able. How would you feel if your little brother or sister was tortured so as someone could have some lipstick???? Animal testing is wrong. Vote Up0Vote Down  Reply 5 years ago Rationalist Will people opposing animal testing offer themselves in their place? Or should we not do any medical research at all, for an AIDS cure or for Cancer, Alzheimers… Vote Up1Vote Down  Reply 5 years ago Category: Environment and Animal WelfareScience Search Debates: Popular Debates Should the Cell Phones Be Allowed in Schools Space Exploration Is a Waste of Money Homework Should Be Banned Junk Food Should Be Banned Should Smoking Be Banned in Public Places? Do You Agree or Disagree With Euthanasia or Mercy Killing? Child Soldiers Should Be Prosecuted Is Modern Technology Good or Bad? The Minimum Driving Age Should Be Raised to 18 Democracy Is the Best Form of Government Categories Business | Computers and Internet | Culture and Entertainment | Economics and Finance | Education | Environment and Animal Welfare | European Union | Food and Drink | Health | History | International / Global Affairs | Law and Crime | Life and Style | Moral and Religious | Peace, Security, and Human Rights | Politics | Psychology | Science | Society | Sports | Transport | Work Home | About Us | Privacy & Contact Us Top wpDiscuz 18shares ",
        "sourceTextConclusionEnd": 57,
        "sourceTextConclusionStart": 22,
        "sourceTextPremiseEnd": 52887,
        "sourceTextPremiseStart": 52885,
        "sourceTitle": "Animal testing for medical research - DebateWise",
        "sourceUrl": "https://debatewise.org/debates/286-animal-testing-for-medical-research/"
    },
    "id": "Se511ec5-A4a6c46b4",
    "premises": [
        {
            "annotations": [],
            "stance": "CON",
            "text": "no"
        }
    ]
}