{
    "conclusion": "No. Science and Society define the stages of life and 16-year-olds are not adults yet, with all the same responsibilities, priviledges & rights.",
    "context": {
        "acquisitionTime": "2019-04-19T12:44:57Z",
        "aspects": [],
        "discussionTitle": "Should 16 year olds be able to vote at presidental elections?",
        "mode": "discussion",
        "sourceDomain": "debatewise",
        "sourceId": "Sed086351",
        "sourceText": "Browse Our Categories Should 16 year olds be able to vote at presidental elections? Last updated: February 23, 2017 Not over a boy - but over the fact that, at 17, she will not be allowed to vote for president this November. And the Walled Lake, Mich., teen aims to do something about that. Holbrook is part of a movement to lower the voting age. It's an idea several states - as well as foreign countries - are considering as politicians desperately search for ways to boost dismal and sinking turnout among young adults. \"I am very, very interested in politics in general,\" said Lindsay, a John Kerry supporter who turns 18 in December. \"It just breaks my heart - I'm just going to miss the cutoff.\" It sounds counterintuitive: Young adults don't vote, so lower the voting age. But advocates say 18 is the worst time to start voting because that's when teenagers' lives are in turmoil - moving away to college, stressing out over graduation, getting a job, joining the armed forces. And studies show voting is a habit that has to start early. If people don't start out as voters, they're less likely to ever vote. Some researchers fear that as this generation of nonvoters ages, they will stay that way, causing a dangerous dive in voter turnout as baby boomers and older generations die out. In the 2000 election, senior citizens voted at about twice the rate of 18- to 24-year-olds. \"As I was visiting schools, as I talked to classes, I asked them what kind of things would make a difference,\" said Minnesota state Sen. Steve Kelley, a Democrat from Hopkins, Minn. \"Among the ideas tossed out were having 17-year-olds be able to vote.\" Kelley's bill to allow just that has passed a committee. Activists are pushing to go further: They want 16-year-olds to be able to vote. At that age most teenagers can work, pay taxes, drive and be charged as adults for crimes - even be sentenced to death - said Alex Koroknay-Palicz, executive director of the National Youth Rights Association. In most states, 16-year-olds can get a driver's license, though usually with restrictions. And while almost every state requires that a couple be 18 to marry on their own, most states let 16- and 17-year-olds wed if they have their parents' consent. In New Hampshire, girls as young as 13 can marry, as long as they have permission from their parents. \"What kind of twisted message do we send when we describe a murderer as a 'mature, responsible adult' and describe a 14- or 16-year-old student looking to vote as a 'stupid little kid.' This is hypocritical and wrong,\" said Koroknay-Palicz, 22. A federal constitutional amendment lowered the voting age to 18 in 1971. States are allowed to set their ages lower, but not higher. In 2002, Cambridge, Mass., city leaders voted to lower the local voting age to 17. But the state legislature, which has the final say, has not approved the change. Maine is considering letting 17-year-olds vote in primaries, as long as they turn 18 by the general election, something several other states already allow. In Florida, advocates hope to have an initiative on this fall's ballot lowering the voting age to 16. Proposals also have been introduced in Texas and Hawaii. California has the most radical proposal: a constitutional amendment that would give 16-year-olds a half vote and 14-year-olds a quarter vote in state elections beginning in 2006. Britain is considering lowering its voting age to 16, a proposal that picked up the backing of the ruling Labor Party. And Canada's chief elections officer in March suggested doing the same thing. In those nations, as in the United States, the push for a lower voting age is driven by the falling rates at which 18- to 25-year-olds vote. Governments are desperate to try to bring young people back into the civic fold, to make them feel they have a stake in their countries. Since the national voting age was lowered to 18 in 1971, the voting rate among 18- to 24-year-olds has dropped fairly steadily. In the 2000 election, 42 percent of young adults voted, compared with 70 percent of those older than 25. This year will see unprecedented efforts to get young adults interested in voting in the November election. Everyone from professional wrestlers to TV producers to MTV has some kind of youth voting initiative. None of the efforts to lower the voting age will be in force in time for this fall's presidential election - much to the dismay of Caroline DuWors, 16, a junior at Milford High School. \"I've formed my opinions on the candidates and stayed up with their campaigns as much as possible,\" Caroline said. \"I think a common misconception among adults is that all teenagers would rather sleep or go shopping than think about politics.\" Elections experts are divided. \"I think it's a dumb idea,\" said Curtis Gans, director of the Committee for the Study of the American Electorate. The voting age was set at 18 because that's the age at which people could be drafted and die for their country. They don't have enough life experience or history and don't know the issues in enough detail, he said. \"There are other ways to learn politics,\" he said, such as volunteering on a campaign or working as a poll volunteer on Election Day. Kay Stimson, director of the New Millennium Young Voters Project at the National Association of Secretaries of State, said she was glad lowering the voting age is getting more attention than it has since 1971. \"Any movement that gets young people involved in the electoral process is definitely a positive one,\" she said. Getting teenagers in the habit of voting will make them lifetime voters, advocates say. And school provides the perfect place to train future voters, both in civics and the basic logistics of voting. A Yale University study last year found that students shown how to operate a voting machine were more than twice as likely to vote as students who weren't shown. By lowering the voting age to 16, \"you might be able to make voting part of a civics education class,\" said Mark Lopez, research director at the Center for Information and Research on Civic Learning and Engagement. Lowering the voting age might have little effect on the presidential race. Polls have shown young voters about as split as their elders. If they differ at all, they tend to be more libertarian - more tolerant of gay marriage, for example, and more supportive of privatizing Social Security. After all, most teenagers have a leave-me-alone attitude that could be described politically as libertarian, said James Gimpel, an expert on young voters at the University of Maryland. Gimpel, who has forecast the possible crash in voter turnout, said he was intrigued with the idea of lowering the voting age but not sure of its impact. People who were going to be likely All the Yes points: bad law !!!!!!!!!!!!!!!!!!!!!! All the No points: children at 16 have no sense of decesion making No, wrong subject. No. too immature. No. Science and Society define the stages of life and 16-year-olds are not adults yet, with all the same responsibilities, priviledges & rights. No. Science and Society define the stages of life and 16-year-olds are not adults yet, with all the same responsibilities, priviledges & rights. 60shares Facebook Twitter Pinterest Email Should 16 year olds be able to vote at presidental elections? Yes because... bad law !!!!!!!!!!!!!!!!!!!!!! just because we are sixteen does not mean that we dont have an opinion why do not get to say what we want to say and why do we have any less value than adults. No because... They are not mature enough to know whom to vote for and for what genuine reasons. A lot of 18 yr olds have not matured enough. Maturity arrives with the knowledge of the unniversity of LIFE and not school college or unniversity or video games. Should 16 year olds be able to vote at presidental elections? No because... children at 16 have no sense of decesion making I'd like to tell my fellow opponents that voting requires complete thinking and high order thinking.....added to it gud decesion making is also needed .....and children at 16....have no sense...they will go copying others and make a decesion that will spoil their and other's life ...so, according to me voting age should nt be reduced Yes because... It is a stereotype to suggest that anybody under a certain age is incapable of making decisions- as a sixteen year old myself I feel perfectly happy to make a vote, as I'm sure many others would too. Should 16 year olds be able to vote at presidental elections? No because... No, wrong subject. No, 16 yr olds should not be allowed to vote. They are the best on games and mindless modern trivia, but not on worldly subjects or politics. Yes because... Should 16 year olds be able to vote at presidental elections? No because... No. too immature. Far too young to know what politics are about. If they want to vote let them be punished as adults when they break the law. They also don't understand the implication of certain political actions and do not possess the maturity to wait it out or think a policy through when voting. Most of them also do not understand the ideologies of parties in detail. You can go around asking other teenagers about left-wing parties or Marxist parties. The most common answer you would get is 'I don't know' Yes because... Should 16 year olds be able to vote at presidental elections? No because... No. Science and Society define the stages of life and 16-year-olds are not adults yet, with all the same responsibilities, priviledges & rights. It is widely recognized by science and society that there are defined stages in the life of every individual, which overall, apply to the majority of the population. There may be some (rare) exceptions, such as the 13-year-old that is so brilliant they are enrolled in college, but even in such cases, certainly 13-year-olds are not fully mature in other ways. Sixteen-year-olds, lacking the experience and knowledge of fully mature adults, are susceptible to believing in ideas that they have not been able to test the validity of through experience, or by gaining enough neccessary knowledge about the ideas presented that they lack the ability to be able to apply any real sense of discernment about those ideas. It takes time and maturity to become a fully-informed adult capable of weighing the pros and cons of ideas to come to reasonable and responsible decisions. Sixteen-year-olds, at their stage in life, are dealing with issues that adults, for the most part, have already had experience with - growing bodies, peer acceptance/rejection, relationships with the opposite sex, getting a basic education, thinking about what they are going to do for a future career , etc.. Their time is occupied with these new (to them) and neccessary things - there is time enough for them to worry about voting. They should be interested in things such as politics and issues our country faces, but they are still in a learning stage. To allow them to vote before they are fully developed adults is folly. Politicians that are behind the idea of allowing 16-year-olds to vote are simply hoping to take advantage of their lack of knowledge and experience. To more fully drive home my point that sixteen-year-olds are not mature enough to vote, I offer the following article from the website \"Live Science\" concerning the development of the human brain: At an age when Americans are first considered adults, their brains are still maturing, a new study suggests. Researchers at Dartmouth College scanned the brains of nineteen 18-year-old students who had moved more than 100 miles to attend school. \"During the first year of college, students have many new experiences,\" said psychologist Abigail Baird, the study's principal investigator. \"They are faced with new cognitive, social, and emotional challenges.\" A group of 17 older students, ranging in age from 25 to 35, served as a control group for comparison. The results showed that the freshmen students' brains underwent significant changes and were very different from that of the older adults. The researchers believe the changes represent an increased awareness of the students' inner feelings and an improved ability to organize and integrate incoming sensory information; this synthesis helps shape the kinds of emotional and behavioral responses they have to new experiences. The results are consistent with other research suggesting that the human brain continues to grow and mature right up to the point when we become adults and even beyond. In another study, researchers found that humans don't really develop the ability to handle multiple pieces of information at once until about the ages of 16 or 17. \"The brain of an 18-year-old college freshman is still far from resembling the brain of someone in their mid-twenties,\" said Craig Bennett, a graduate student who was involved in the new research. \"When do we reach adulthood? It might be much later than we traditionally think.\" Yes because... Should 16 year olds be able to vote at presidental elections? No because... No. Science and Society define the stages of life and 16-year-olds are not adults yet, with all the same responsibilities, priviledges & rights. It is widely recognized by science and society that there are defined stages in the life of every individual, which overall, apply to the majority of the population. There may be some (rare) exceptions, such as the 13-year-old that is so brilliant they are enrolled in college, but even in such cases, certainly 13-year-olds are not fully mature in other ways. Sixteen-year-olds, lacking the experience and knowledge of fully mature adults, are susceptible to believing in ideas that they have not been able to test the validity of through experience, or by gaining enough neccessary knowledge about the ideas presented that they lack the ability to be able to apply any real sense of discernment about those ideas. It takes time and maturity to become a fully-informed adult capable of weighing the pros and cons of ideas to come to reasonable and responsible decisions. Sixteen-year-olds, at their stage in life, are dealing with issues that adults, for the most part, have already had experience with - growing bodies, peer acceptance/rejection, relationships with the opposite sex, getting a basic education, thinking about what they are going to do for a future career , etc.. Their time is occupied with these new (to them) and neccessary things - there is time enough for them to worry about voting. They should be interested in things such as politics and issues our country faces, but they are still in a learning stage. To allow them to vote before they are fully developed adults is folly. Politicians that are behind the idea of allowing 16-year-olds to vote are simply hoping to take advantage of their lack of knowledge and experience. To more fully drive home my point that sixteen-year-olds are not mature enough to vote, I offer the following article from the website \"Live Science\" concerning the development of the human brain: At an age when Americans are first considered adults, their brains are still maturing, a new study suggests. Researchers at Dartmouth College scanned the brains of nineteen 18-year-old students who had moved more than 100 miles to attend school. \"During the first year of college, students have many new experiences,\" said psychologist Abigail Baird, the study's principal investigator. \"They are faced with new cognitive, social, and emotional challenges.\" A group of 17 older students, ranging in age from 25 to 35, served as a control group for comparison. The results showed that the freshmen students' brains underwent significant changes and were very different from that of the older adults. The researchers believe the changes represent an increased awareness of the students' inner feelings and an improved ability to organize and integrate incoming sensory information; this synthesis helps shape the kinds of emotional and behavioral responses they have to new experiences. The results are consistent with other research suggesting that the human brain continues to grow and mature right up to the point when we become adults and even beyond. In another study, researchers found that humans don't really develop the ability to handle multiple pieces of information at once until about the ages of 16 or 17. \"The brain of an 18-year-old college freshman is still far from resembling the brain of someone in their mid-twenties,\" said Craig Bennett, a graduate student who was involved in the new research. \"When do we reach adulthood? It might be much later than we traditionally think.\" Yes because... 60shares Facebook Twitter Pinterest Email Related Debates: Foreign workers should be given the right to vote in local elections… Children Should Have The Right To Vote In Elections Recall elections Canadian Senate Elections Individuals should be able to legally bypass copyright protection… Minors Should Be Able to Obtain Abortions Without Parental Consent 5 Continue the Debate - Leave a Comment 5 Comment threads 0 Thread replies 0 Followers   Most reacted comment Hottest comment thread 5 Comment authors   Subscribe   Notify of new follow-up comments new replies to my comments Unicorn Yes because if they are old enough to pay tax they should be able to vote especially as politics is often about tax Vote Up0Vote Down  Reply 1 year ago Noori Thompson Yes, because many sixteen year olds are already biologically adults and have finished puberty. Also, saying that teens don’t care about politics, will get too influenced by their parents, or will just add on more liberal voters is just basically sterotyping. There are many teenage conservative bloggers, and a couple years ago, I was very conservative. They are more shaped by others and society, and that is no less true than for the 18-24 demographic. Also, it is hypocritical to say that the government does not discriminate based on age. Vote Up0Vote Down  Reply 2 years ago Eric So here’s a question — would the U.S. be willing to change the age of consent to 16 — where a 40 year old can have sex with a 16 year old? I think the answer would be a resounding no. Frankly, the reason why there are different things at age 16 and others at 18, is because 16 is the beginning of the journey. 16 years olds can have opinions — they can be informed. But they do not have the life experience yet to know the impact of their decisions. You can be the most educated and mature 16 year old on the planet — you will not have enough life experience yet to be able to discern the what’s and why’s. This is just a ploy by the left to create a permanent majority for themselves. Vote Up-3Vote Down  Reply 2 years ago Dave We would love to hear what you think – please leave a comment! Vote Up0Vote Down  Reply 2 years ago nayroJ I believe that 16 year old students should be given the right to vote. Simply because, in most states at 16 you are seen as an adult, in a court of law that is, you’re automatically stamped with, “you’re responsible for your actions”, if that may be the case than why not be allowed to vote? I mean seriously, if the older population are the only people who get to vote they do so for their own benefit half of the time; that is completely disregarding the up-coming generation, I guess what I am trying to say is that, we, the younger generation, shouldn’t have our right transgressed just because of an age factor let alone what society thinks. It is crucial to allow younger people who are still in school to vote in matter that will certainly affect them in the near future. Vote Up2Vote Down  Reply 4 years ago Category: Politics Search Debates: Popular Debates Should the Cell Phones Be Allowed in Schools Space Exploration Is a Waste of Money Homework Should Be Banned Junk Food Should Be Banned Should Smoking Be Banned in Public Places? Do You Agree or Disagree With Euthanasia or Mercy Killing? Is Modern Technology Good or Bad? Child Soldiers Should Be Prosecuted The Minimum Driving Age Should Be Raised to 18 Democracy Is the Best Form of Government Categories Business | Computers and Internet | Culture and Entertainment | Economics and Finance | Education | Environment and Animal Welfare | European Union | Food and Drink | Health | History | International / Global Affairs | Law and Crime | Life and Style | Moral and Religious | Peace, Security, and Human Rights | Politics | Psychology | Science | Society | Sports | Transport | Work Home | About Us | Privacy & Contact Us Top wpDiscuz 60shares ",
        "sourceTextConclusionEnd": 13223,
        "sourceTextConclusionStart": 13079,
        "sourceTextPremiseEnd": 16667,
        "sourceTextPremiseStart": 13224,
        "sourceTitle": "Should 16 year olds be able to vote at presidental elections? - DebateWise",
        "sourceUrl": "https://debatewise.org/debates/3667-should-16-year-olds-be-able-to-vote-at-presidental-elections/"
    },
    "id": "Sed086351-A19b607d6",
    "premises": [
        {
            "annotations": [],
            "stance": "PRO",
            "text": "It is widely recognized by science and society that there are defined stages in the life of every individual, which overall, apply to the majority of the population. There may be some (rare) exceptions, such as the 13-year-old that is so brilliant they are enrolled in college, but even in such cases, certainly 13-year-olds are not fully mature in other ways. Sixteen-year-olds, lacking the experience and knowledge of fully mature adults, are susceptible to believing in ideas that they have not been able to test the validity of through experience, or by gaining enough neccessary knowledge about the ideas presented that they lack the ability to be able to apply any real sense of discernment about those ideas. It takes time and maturity to become a fully-informed adult capable of weighing the pros and cons of ideas to come to reasonable and responsible decisions. Sixteen-year-olds, at their stage in life, are dealing with issues that adults, for the most part, have already had experience with - growing bodies, peer acceptance/rejection, relationships with the opposite sex, getting a basic education, thinking about what they are going to do for a future career , etc.. Their time is occupied with these new (to them) and neccessary things - there is time enough for them to worry about voting. They should be interested in things such as politics and issues our country faces, but they are still in a learning stage. To allow them to vote before they are fully developed adults is folly. Politicians that are behind the idea of allowing 16-year-olds to vote are simply hoping to take advantage of their lack of knowledge and experience. To more fully drive home my point that sixteen-year-olds are not mature enough to vote, I offer the following article from the website \"Live Science\" concerning the development of the human brain: At an age when Americans are first considered adults, their brains are still maturing, a new study suggests. Researchers at Dartmouth College scanned the brains of nineteen 18-year-old students who had moved more than 100 miles to attend school. \"During the first year of college, students have many new experiences,\" said psychologist Abigail Baird, the study's principal investigator. \"They are faced with new cognitive, social, and emotional challenges.\" A group of 17 older students, ranging in age from 25 to 35, served as a control group for comparison. The results showed that the freshmen students' brains underwent significant changes and were very different from that of the older adults. The researchers believe the changes represent an increased awareness of the students' inner feelings and an improved ability to organize and integrate incoming sensory information; this synthesis helps shape the kinds of emotional and behavioral responses they have to new experiences. The results are consistent with other research suggesting that the human brain continues to grow and mature right up to the point when we become adults and even beyond. In another study, researchers found that humans don't really develop the ability to handle multiple pieces of information at once until about the ages of 16 or 17. \"The brain of an 18-year-old college freshman is still far from resembling the brain of someone in their mid-twenties,\" said Craig Bennett, a graduate student who was involved in the new research. \"When do we reach adulthood? It might be much later than we traditionally think.\""
        }
    ]
}