{
    "conclusion": "We've always wanted more",
    "context": {
        "acquisitionTime": "2019-04-19T12:44:21Z",
        "aspects": [],
        "discussionTitle": "Technological Advancement Promotes Materialistic Society?",
        "mode": "discussion",
        "sourceDomain": "debatewise",
        "sourceId": "Sf47ad497",
        "sourceText": "Browse Our Categories Technological Advancement Promotes Materialistic Society? Last updated: December 20, 2016 People saythe advancement of technology is the main reason we have a materialistic society nowadays, but as far as I know, technology is something which makes our lives more convenient, so is technology the problem or something else? For example, the desire of human beings wanting more or something else? All the Yes points: All the No points: \"Materialistic\" by whose standards - and why would technology make people more materialistic than what they already are? We've always wanted more We've always wanted more Facebook Twitter Pinterest Email Technological Advancement Promotes Materialistic Society? No because... \"Materialistic\" by whose standards - and why would technology make people more materialistic than what they already are? From the beginnning, mankind has engaged in the aquisition of things he deems necessary to his physical, mental and emotional well-being. Some of these things are basic and essential to life itself - food, water, clothing, shelter. Other things may not be neccessary for the basic maintenance of life itself, but may add greatly to a person's quality of life. Such things may include the pursuit of higher knowledge, pleasurable pursuits such as playing musical instruments or just listening to music, producing or purchasing art, and so forth; the list is endless. These \"needs\" versus \"wants\", as we may call them, are summed up in Maslow's hierarchy of needs (as found in many psychology, sociology and educational training textbooks). The term \"materialistic\" has become synonmous with \"greed\". Greed is something that has been with us since the beginning of mankind. The only difference between today and primitive times is that we have a great many more products and services to choose from. Greed is a relative term. Just because people had fewer products and services to aquire for themselves did not make them any less greedy for their time. Human nature remains as it was in primitive times. The danger we face today is in how we define \"materialism\" and \"greed\". Who defines our wants and needs? Should that be up to the individual, the people, a small group of elites in power, or a single leader? We must be careful at any suggestion of limiting what people may acquire and the means by which they can acquire things. Do you really want someone else to decide for you what you are entitled to, particularly when you are aquiring things through your own efforts? Do you want someone to have authority over what and how much you can eat, what and how much clothing you can have, and where you can live, and how big a place you can live in? Do you want them to be able to take a greater and greater percentage of your wealth (through taxes and other means) to \"spread the wealth\" to others who are complete strangers to you, and may not deserve the fruits of your labor for one reason or another? Or would you rather have a choice between all of the products and services made available through the advances (including technology) that man has made over eons of time? Technology has made advancements in many fields that have improved peoples' longevity and quality of life. Would you lrather be free to make choices as an individual, or do you really want to surrender the control of your life to other men, as though they are superior in knowledge and morality (pseudo-gods) to make decisions that affect you in a lasting and very personal way? I suggest people think more deeply about words and slogans like \"materialism\" tossed about so casually today, and realize the full import of what may lie behind these words and slogans. (\"Hope\" and \"change\" everyone, ha ha!). Yes because... Technological Advancement Promotes Materialistic Society? No because... We've always wanted more Its never enough. Plain and simple as that. As long as there are scientists there are people desiring more and more. I agree, Technology is spreading across the world making everyone want more, but realistically speaking, its just making people realize what we have the capability of. 70\" LED TVS!? Really? Mobile phones capable of phone calls, playing music, playing movies, accessing the internet. Mobile computers, touch screen tablets, E readers all the way to Pens that record your movement and documents not only what you write but what the microphone inside hears to capture notes and lectures. The internet in itself is an amazing creation. Now people can not only email all over the world, but play actual high end graphic 3D video games with (seemingly) countless people from all around the globe, meeting together in this virtual world to work together or against each other to complete a task at hand. Now that people have tasted excess they want more and they know what technology is capable of today or tomorrows. Its so much more than being materialistic. Its a convenience and understanding of where we stand as a technological society Yes because... Technological Advancement Promotes Materialistic Society? No because... We've always wanted more Its never enough. Plain and simple as that. As long as there are scientists there are people desiring more and more. I agree, Technology is spreading across the world making everyone want more, but realistically speaking, its just making people realize what we have the capability of. 70\" LED TVS!? Really? Mobile phones capable of phone calls, playing music, playing movies, accessing the internet. Mobile computers, touch screen tablets, E readers all the way to Pens that record your movement and documents not only what you write but what the microphone inside hears to capture notes and lectures. The internet in itself is an amazing creation. Now people can not only email all over the world, but play actual high end graphic 3D video games with (seemingly) countless people from all around the globe, meeting together in this virtual world to work together or against each other to complete a task at hand. Now that people have tasted excess they want more and they know what technology is capable of today or tomorrows. Its so much more than being materialistic. Its a convenience and understanding of where we stand as a technological society Yes because... Facebook Twitter Pinterest Email Related Debates: Children should not be allowed to inherit vast wealth as this damages… Corporations are a threat to Democracy and society. Is deregulation good for society? Science: a Threat to Society? Reality Television Has Negative Effects on Society Positive Discrimination Towards Women in Society Is Justified 1 Continue the Debate - Leave a Comment 1 Comment threads 0 Thread replies 0 Followers   Most reacted comment Hottest comment thread 1 Comment authors   Subscribe   Notify of new follow-up comments new replies to my comments Dave We would love to hear what you think – please leave a comment! Vote Up0Vote Down  Reply 2 years ago Category: Society Search Debates: Popular Debates Should the Cell Phones Be Allowed in Schools Space Exploration Is a Waste of Money Homework Should Be Banned Junk Food Should Be Banned Should Smoking Be Banned in Public Places? Do You Agree or Disagree With Euthanasia or Mercy Killing? Child Soldiers Should Be Prosecuted Is Modern Technology Good or Bad? The Minimum Driving Age Should Be Raised to 18 Democracy Is the Best Form of Government Categories Business | Computers and Internet | Culture and Entertainment | Economics and Finance | Education | Environment and Animal Welfare | European Union | Food and Drink | Health | History | International / Global Affairs | Law and Crime | Life and Style | Moral and Religious | Peace, Security, and Human Rights | Politics | Psychology | Science | Society | Sports | Transport | Work Home | About Us | Privacy & Contact Us Top wpDiscuz ",
        "sourceTextConclusionEnd": 5112,
        "sourceTextConclusionStart": 5088,
        "sourceTextPremiseEnd": 6264,
        "sourceTextPremiseStart": 5113,
        "sourceTitle": "Technological Advancement Promotes Materialistic Society? - DebateWise",
        "sourceUrl": "https://debatewise.org/debates/29071-does-technology-advancement-promotes-a-materialistic-society/"
    },
    "id": "Sf47ad497-A36405581",
    "premises": [
        {
            "annotations": [],
            "stance": "PRO",
            "text": "Its never enough. Plain and simple as that. As long as there are scientists there are people desiring more and more. I agree, Technology is spreading across the world making everyone want more, but realistically speaking, its just making people realize what we have the capability of. 70\" LED TVS!? Really? Mobile phones capable of phone calls, playing music, playing movies, accessing the internet. Mobile computers, touch screen tablets, E readers all the way to Pens that record your movement and documents not only what you write but what the microphone inside hears to capture notes and lectures. The internet in itself is an amazing creation. Now people can not only email all over the world, but play actual high end graphic 3D video games with (seemingly) countless people from all around the globe, meeting together in this virtual world to work together or against each other to complete a task at hand. Now that people have tasted excess they want more and they know what technology is capable of today or tomorrows. Its so much more than being materialistic. Its a convenience and understanding of where we stand as a technological society"
        }
    ]
}